backend/app/controllers/boards_controller.rb

    def index
        boards = Board.all
---
SELECT "boards".* FROM "boards"

    def show
        board = Board.find(params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 82], ["LIMIT", 1]]

    def create
        board = Board.create(board_params)
---
INSERT INTO "boards" ("title", "category", "user_id", "created_at", "updated_at", "background") VALUES (?, ?, ?, ?, ?, ?)  [["title", "reqwe"], ["category", "hello"], ["user_id", 134], ["created_at", "2020-06-17 17:07:37.864369"], ["updated_at", "2020-06-17 17:07:37.864369"], ["background", ""]]

    def update
        board = Board.find(params[:id])
        board.update(board_params)
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 155], ["LIMIT", 1]]
UPDATE "boards" SET "background" = ?, "updated_at" = ? WHERE "boards"."id" = ?  [["background", "cork_board.jpg"], ["updated_at", "2020-06-16 17:28:34.073571"], ["id", 155]]

    def destroy
        board = Board.find(params[:id])
        board.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 251], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = ?  [["id", 251]]