backend/app/controllers/goals_controller.rb

    def index
        goals = Goal.all
---
SELECT "goals".* FROM "goals"

    def show
        goal = Goal.find(params[:id])
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 601], ["LIMIT", 1]]

    def create
        goal = Goal.create(goal_params)
---
INSERT INTO "goals" ("title", "content", "status", "board_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Teddy"], ["content", "jhgjkg"], ["status", "In Progress"], ["board_id", 155], ["created_at", "2020-06-16 22:31:32.364391"], ["updated_at", "2020-06-16 22:31:32.364391"]]

    def update
        goal = Goal.find(params[:id])
        goal.update(goal_params)
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 602], ["LIMIT", 1]]
UPDATE "goals" SET "title" = ?, "content" = ?, "status" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["title", "Colton Kaiser"], ["content", "jhgjkg"], ["status", "In Progress"], ["updated_at", "2020-06-17 19:00:04.656488"], ["id", 1014]]

    def destroy
        goal = Goal.find(params[:id])
        goal.destroy
---
SELECT "goals".* FROM "goals" WHERE "goals"."id" = ? LIMIT ?  [["id", 1005], ["LIMIT", 1]]
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 1005]]