backend/app/controllers/users_controller.rb

    def create
        new_user = User.new(new_user_params)
        if new_user.valid?
        new_user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "test2@gmail.com"], ["first_name", "test"], ["last_name", "teseter"], ["created_at", "2020-06-15 23:25:50.822127"], ["updated_at", "2020-06-15 23:25:50.822127"]]